---
kind: method
id: M:Autodesk.Revit.DB.MEPConnectorInfo.Dispose
source: html/4cc4004c-0546-8bc7-e318-3239b9a99a14.htm
---
# Autodesk.Revit.DB.MEPConnectorInfo.Dispose Method

Releases all resources used by the MEPConnectorInfo

## Syntax (C#)
```csharp
public void Dispose()
```